PANDAS PROBLEMS

In [4]:
import numpy as np
import pandas as pd  ## INSTALLATION of Pandas


1. Write a Python program to create and display a one-dimensional array-like object
containing an array of data using Pandas module.

In [5]:
data = np.array(['a','b','c','f'])

In [6]:
print(data)

['a' 'b' 'c' 'f']

In [7]:
df = pd.Series(data)

In [8]:
df

0    a
1    b
2    c
3    f
dtype: object

2. Write a Python program to convert a Panda module Series to Python list and it's type

In [11]:
lst = df.tolist()  # Convert the series module into list

In [12]:
print(lst)

['a', 'b', 'c', 'f']

3. Write a Python program to add, subtract, multiple and divide two Pandas Series.
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [13]:
a = np.array([2, 4, 6, 8, 10])
b = np.array([1, 3, 5, 7, 9])

In [23]:
df1 = pd.Series(a)
df2 = pd.Series(b)
df1 , df2

(0     2
 1     4
 2     6
 3     8
 4    10
 dtype: int32,
 0    1
 1    3
 2    5
 3    7
 4    9
 dtype: int32)

In [24]:
z = df1.sub(df2) #subtraction of two array using pandas
print(z)

0    1
1    1
2    1
3    1
4    1
dtype: int32

In [25]:
c = df1.mul(df2) ## multiple of two array using pandas
print(c)

0     2
1    12
2    30
3    56
4    90
dtype: int32

In [26]:
f = df1.div(df2)  # division of two series(df) using pandas
f

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

4. Write a Python program to get the powers of an array values element-wise.
Note: First array elements raised to powers from second array

In [31]:
array = np.arange(8)

print(array)

[0 1 2 3 4 5 6 7]

In [32]:
print(np.power(array,3))

[  0   1   8  27  64 125 216 343]

5. Write a Python program to create and display a DataFrame from a specified dictionary
data which has the index labels.

In [70]:

exam_data ={'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
    
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']    
df = pd.DataFrame(exam_data , index = labels )
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

6. Write a Python program to display a summary of the basic information about a
specified Data Frame and its data.

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

7. Write a Python program to get the first 3 rows of a given DataFrame.
Sample Python dictionary data and list labels

In [72]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

8. Write a Python program to select the 'name' and 'score' columns from the following
Data Frame

In [73]:
df[['name','score']] # type 1

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [43]:
df.columns

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

9. Write a Python program to select the specified columns and rows from a given data
frame

In [74]:
df[['name','score']].iloc[[1,3,5,6]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

10. Write a Python program to select the rows where the number of attempts in the
examination is greater than 2

In [75]:
df[df['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

11. Write a Python program to count the number of rows and columns of a DataFrame

In [76]:
df.shape  # .shape

(10, 4)

12. Write a Python program to select the rows where the score is missing, i.e. is NaN.

In [77]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

13. Write a Python program to select the rows where number of attempts in the
examination is less than 2 and score greater than 15

In [78]:
print(df[(df['attempts'] < 2) & (df['score'] > 15)])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

14. Write a Python program to change the score in row 'd' to 11.5.

In [81]:
df.loc['d','score'] = 11.5

df

15. Write a Python program to calculate the sum of the examination attempts by the
students

In [88]:
print("The number of attempts of the students :",df['attempts'].sum())

The number of attempts of the students : 19

16. Write a Python program to calculate the mean score for each different student in
DataFrame

In [92]:
print("\nMean score for each different student in data frame:")
df['score'].mean()

Mean score for each different student in data frame:

13.333333333333334

17. Write a Python program to append a new row 'k' to data frame with given values for
each column. Now delete the new row and return the original DataFrame.

In [93]:
df.loc['k'] = ['Suresh', 15.5, 1,'yes']

In [94]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

In [95]:
df.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

18. Write a Python program to sort the DataFrame first by 'name' in descending order,
then by 'score' in ascending order.

In [98]:
df.sort_values(by = ['name','score'] , ascending=[False,True])

        name  score  attempts qualify
k     Suresh   15.5         1     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

19. Write a Python program to replace the 'qualify' column contains the values 'yes' and
'no' with True and False

In [100]:
df['qualify'] = df['qualify'].map({'yes':True,'no':False})

In [101]:
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k     Suresh   15.5         1     True

20. Write a Python program to delete the 'attempts' column from the DataFrame

In [117]:
 df.drop("attempts" , axis = 1)

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James   11.5    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True
k     Suresh   15.5     True

21. Write a Python program to insert a new column in existing DataFrame

In [120]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red','Blue']
df['color'] = color

In [128]:
df

        name  score  attempts  qualify   color
a  Anastasia   12.5         1     True     Red
b       Dima    9.0         3    False    Blue
c  Katherine   16.5         2     True  Orange
d      James   11.5         3    False     Red
e      Emily    9.0         2    False   White
f    Michael   20.0         3     True   White
g    Matthew   14.5         1     True    Blue
h      Laura    NaN         1    False   Green
i      Kevin    8.0         2    False   Green
j      Jonas   19.0         1     True     Red
k     Suresh   15.5         1     True    Blue

22. Write a Python program to iterate over rows in a DataFrame.

In [130]:
for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James 11.5
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0
Suresh 15.5

23. Write a Python program to get list from DataFrame column headers.
Sample data

In [124]:
lst = df.columns

In [125]:
print(lst)

Index(['name', 'score', 'attempts', 'qualify', 'color'], dtype='object')